ErpTest/src/Documents/пкЗаданиеНаРемонт/пкЗаданиеНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкЗаданиеНаРемонт</name>
  <registerRecords>AccumulationRegister.пкЗаданияНаРемонт</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРемонта</name>
    <type>
      <types>EnumRef.пкМестоРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>пкПрикрепленыФайлыВДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланируемыеРаботы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/пкРаботыВЗаказНаряде/пкРаботыВЗаказНаряде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкРаботыВЗаказНаряде</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаданиеНаРемонт</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкВыгрузкаСостоянияТехники/пкВыгрузкаСостоянияТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкВыгрузкаСостоянияТехники</name>
  <resources>
    <name>ВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершенияРемонта</name>
    <type>
      <types>String</types>
      <types>Date</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыТехники</types>
    </type>
  </resources>
  <resources>
    <name>СтатусРемонта</name>
    <type>
      <types>EnumRef.пкСтатусыРемонтаТехники</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождения</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <resources>
    <name>ЗаказНаряд</name>
    <type>
      <types>DocumentRef.пкЗаказНаряд</types>
    </type>
  </resources>
  <resources>
    <name>НадписьЕстьРезерв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостановкаНаУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследнийДень</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьРезерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗамененнаяМодель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЗакрепленаЗа</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>СчетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Паспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВахтенныйЖурнал</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопИнформацияПоТехнике</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокGSM</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Заблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРазблокировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСостояниеТехники/пкСостояниеТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСостояниеТехники</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.пкПоказателиСостоянияТехники</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.пкПоказателиСостоянияТехники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСтатусыТехники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыТехники</types>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаЗавершения</name>
    <comment>Планируемая дата перехода в следующий статус (планируемая дата доставки, планируемая дата окончания ремонта)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкМестоРемонта/пкМестоРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкМестоРемонта</name>
  <enumValues>
    <name>УКлиента</name>
  </enumValues>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыТехники</name>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>КВозврату</name>
  </enumValues>
  <enumValues>
    <name>Недоступен</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкПогрузкаВыгрузкаПоДоставке/пкПогрузкаВыгрузкаПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкПогрузкаВыгрузкаПоДоставке</name>
  <comment>Погрузка/выгрузка техники по Доставке</comment>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкСостояниеТехники</registerRecords>
  <registerRecords>InformationRegister.пкСтатусыРемонтаТехники</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.пкОперацииПогрузкаВыгрузка</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательМП</name>
    <type>
      <types>CatalogRef.пкПользователиМП</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/ChartsOfCharacteristicTypes/пкПоказателиСостоянияТехники/пкПоказателиСостоянияТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>пкПоказателиСостоянияТехники</name>
  <type>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>String</types>
    <types>Number</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Местонахождения</name>
      <description>Местонахождения</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>Моточасы</name>
      <description>Моточасы</description>
      <code>000000003</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ТемператураЗамерзанияОхлаждающейЖидкости</name>
      <description>Температура замерзания ох</description>
      <code>000000004</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ErpTest/src/Documents/пкЗаданиеНаРемонт/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ///////////////	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("ОбъектЭксплуатации") Тогда
        Объект.ОбъектЭксплуатации = Параметры.ОбъектЭксплуатации;    
    КонецЕсли; 
    
    Если Параметры.Свойство("Организация") Тогда
        Объект.Организация = Параметры.Организация;    
	КонецЕсли;
	
		
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
			
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		//+++DubI Рарус-СПб 20.04.2017
		//ЗапросРабот = Новый Запрос("ВЫБРАТЬ
		//                           |	пкЗаданияНаРемонтОбороты.Работа,
		//                           |	пкЗаданияНаРемонтОбороты.Регистратор
		//                           |ИЗ
		//                           |	РегистрНакопления.пкЗаданияНаРемонт.Обороты(, , Регистратор, ЗаданиеНаРемонт = &Задание) КАК пкЗаданияНаРемонтОбороты
		//                           |ГДЕ
		//                           |	пкЗаданияНаРемонтОбороты.КоличествоРасход > 0");
		//ЗапросРабот.УстановитьПараметр("Задание",Объект.Ссылка);
		//Результат = ЗапросРабот.Выполнить();
		//Если Не Результат.Пустой() Тогда 
		//	Выборка = Результат.Выбрать();
		//	Для Каждого Стр Из Объект.ПланируемыеРаботы Цикл
		//		Выборка.Сбросить();
		//		Если Выборка.НайтиСледующий(Стр.Работа,"Работа") Тогда
		//			Стр.ЗаказНаряд = Выборка.Регистратор;
		//			//+++DubI Рарус-СПб 31.03.2017
		//			Стр.СтатусЗаказНаряда = Выборка.Регистратор.Статус;
		//			//---DubI Рарус-СПб
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		ЗапросРабот = Новый Запрос("ВЫБРАТЬ
		                           |	пкРаботыВЗаказНаряде.Работа,
		                           |	пкРаботыВЗаказНаряде.Регистратор
		                           |ИЗ
		                           |	РегистрСведений.пкРаботыВЗаказНаряде КАК пкРаботыВЗаказНаряде
		                           |ГДЕ
		                           |	пкРаботыВЗаказНаряде.Количество > 0
		                           |	И пкРаботыВЗаказНаряде.ЗаданиеНаРемонт = &Задание");
		ЗапросРабот.УстановитьПараметр("Задание",Объект.Ссылка);
		Результат = ЗапросРабот.Выполнить();
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Для Каждого Стр Из Объект.ПланируемыеРаботы Цикл
				Выборка.Сбросить();
				Если Выборка.НайтиСледующий(Стр.Работа,"Работа") Тогда
					Стр.ЗаказНаряд = Выборка.Регистратор;
					Стр.СтатусЗаказНаряда = Выборка.Регистратор.Статус;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		//---DubI Рарус-СПб	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеРаботыРаботаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПланируемыеРаботы.ТекущиеДанные;
	
	ТекущаяСтрока.ЕдиницаИзмерения = ПолучитьЗначениеРеквизита(ТекущаяСтрока.Работа, "ЕдиницаИзмерения");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(ОбъектСсылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, ИмяРеквизита);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") И ВладелецФормы.ИмяФормы = "Обработка.пкУправлениеРемонтами.Форма.Форма" Тогда
		Оповестить("ОбновитьДерево");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбъектЭксплуатацииПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ОбъектЭксплуатации) Тогда 
//Рарус Владимир Подрезов 04.10.2017
//Всегда на текущую дату!
//		МестоположениеТ = ПодобратьКлиентаПоМестоположению(Объект.ОбъектЭксплуатации, ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
		МестоположениеТ = ПодобратьКлиентаПоМестоположению(Объект.ОбъектЭксплуатации, ТекущаяДата());
//Рарус Владимир Подрезов Конец
		Если МестоположениеТ <> Неопределено И Объект.МестоРемонта <> ПредопределенноеЗначение("Перечисление.пкМестоРемонта.УКлиента") Тогда 
			ПараметрыОповещения = Новый Структура;
			Оповещение = Новый ОписаниеОповещения("ОбработкаВопросаМестоРемонта", ЭтаФорма, ПараметрыОповещения);
			ПоказатьВопрос(Оповещение, "Техника находится в аренде. Изменить место ремонта?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
			КонецЕсли;
		Если МестоположениеТ <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, МестоположениеТ);
			Если ЗначениеЗаполнено(Объект.Клиент) тогда
				КлиентПриИзмененииНаСервере();	
			КонецЕсли;
		КонецЕсли;
		Если МестоположениеТ <> Неопределено И Объект.МестоРемонта = ПредопределенноеЗначение("Перечисление.пкМестоРемонта.УКлиента") Тогда		
			ПоследнийМенеджер = ОпределитьПоследнегоМенеджераПоТехнике(Объект.ОбъектЭксплуатации);
			Если ЗначениеЗаполнено(ПоследнийМенеджер) Тогда
				ЭтаФорма.Объект.Менеджер = ПоследнийМенеджер;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьПоследнегоМенеджераПоТехнике(Техника)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкВыгрузкаСостоянияТехники.ЗаявкаНаАрендуТехники.Менеджер КАК Менеджер
		|ИЗ
		|	РегистрСведений.пкВыгрузкаСостоянияТехники КАК пкВыгрузкаСостоянияТехники
		|ГДЕ
		|	пкВыгрузкаСостоянияТехники.Техника = &Техника";
	
	Запрос.УстановитьПараметр("Техника", Техника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();		

	Возврат ВыборкаДетальныеЗаписи.Менеджер; 
	

КонецФункции

&НаСервереБезКонтекста
Функция ПодобратьКлиентаПоМестоположению(Техника, Период)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	пкСостояниеТехникиСрезПоследних.Значение КАК ОбъектСтроительства,
	                      |	ВЫБОР
	                      |		КОГДА пкСостояниеТехникиСрезПоследних.Регистратор ССЫЛКА Документ.пкПогрузкаВыгрузкаПоДоставке
	                      |			ТОГДА пкСостояниеТехникиСрезПоследних.Регистратор.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники.Партнер
	                      |		ИНАЧЕ пкСостояниеТехникиСрезПоследних.Значение.Заказчик.Партнер
	                      |	КОНЕЦ КАК Клиент
	                      |ИЗ
	                      |	РегистрСведений.пкСостояниеТехники.СрезПоследних(
	                      |			&Дата,
	                      |			Техника = &Техника
	                      |				И Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Местонахождения)) КАК пкСостояниеТехникиСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыТехники.СрезПоследних(&Дата, Техника = &Техника) КАК пкСтатусыТехникиСрезПоследних
	                      |		ПО пкСостояниеТехникиСрезПоследних.Техника = пкСтатусыТехникиСрезПоследних.Техника
	                      |ГДЕ
	                      |	пкСтатусыТехникиСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.ВАренде)");
	Запрос.УстановитьПараметр("Дата", Период);
	Запрос.УстановитьПараметр("Техника", Техника);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтруктураВозврата = Новый Структура("Клиент,ОбъектСтроительства");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
		Возврат СтруктураВозврата;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаМестоРемонта(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.МестоРемонта = ПредопределенноеЗначение("Перечисление.пкМестоРемонта.УКлиента");
		//МестоРемонтаПриИзменении(Элементы.МестоРемонта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактныеЛицаПартнеров.Ссылка,
	                      |	КонтактныеЛицаПартнеров.Владелец
	                      |ИЗ
	                      |	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	                      |ГДЕ
	                      |	КонтактныеЛицаПартнеров.Владелец = &Владелец
	                      |	И КонтактныеЛицаПартнеров.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Владелец", Объект.Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()=1 Тогда 
		Выборка.Следующий();
		Объект.КонтактноеЛицо=Выборка.Ссылка;
	Иначе	
		Объект.КонтактноеЛицо=Неопределено;
	КонецЕсли;
	Объект.Менеджер = Объект.Клиент.ОсновнойМенеджер;
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНарядыПоТехнике(Команда)
//Рарус Владимир Подрезов 27.02.2017
//Закомментировано
	////++IA не работает без добавления своей настройки в ВариантыОтчетов
	////ДополнительныеПараметры=Новый Структура;
	////ДополнительныеПараметры.Вставить("ИмяКоманды","ДанныеПоТехнике");
	////
	////ПараметрыФормы=Новый Структура;
	////ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов",Ложь);
	////ПараметрыФормы.Вставить("КлючВарианта","Основной");
	////ПараметрыФормы.Вставить("КлючНазначенияИспользования","Основной");
	////ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	////
	////СтруктураПараметров = Новый Структура;
	////СтруктураПараметров.Вставить("ПараметрКоманды", Объект.Техника);
	////СтруктураПараметров.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	////СтруктураПараметров.Вставить("ПараметрыФормы", ПараметрыФормы);
	////
	////МенюОтчетыКлиент.ВыполнитьКомандуОтчет("Отчет.пкАрендаТехники.ФормаОбъекта",
	////		Объект.Техника, ЭтаФорма, СтруктураПараметров);
	//
	//ФормаОтчета = ПолучитьФорму("Отчет.пкЗаказНаряды.ФормаОбъекта",Новый Структура("СформироватьПриОткрытии",Истина),ЭтаФорма);
	//КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
	////СхемаКомпоновкиДанных=Неопределено;
	////ЗаказНарядыПоТехникеНаСервере(СхемаКомпоновкиДанных);
	////КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Найти("ЗаказНаряды").Настройки);
	//Настройки = КомпоновщикНастроек.Настройки.Отбор;
	//
	//Поиск=Ложь;
	//Для каждого ТекОтбор Из Настройки.Элементы Цикл
	//    
	//    Если Строка(ТекОтбор.ЛевоеЗначение) = "Техника" Тогда
	//		Элемент = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ТекОтбор.ИдентификаторПользовательскойНастройки);
	//		Если Элемент <> Неопределено Тогда
	//		    Элемент.Использование = ЗначениеЗаполнено(Объект.ОбъектЭксплуатации);
	//		    Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		    Элемент.ПравоеЗначение = Объект.ОбъектЭксплуатации;
	//		КонецЕсли;
	//		//ТекОтбор.Использование = ЗначениеЗаполнено(Объект.Техника);
	//		//ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		//ТекОтбор.ПравоеЗначение = Объект.Техника;
	//		Поиск=Истина;
	//    КонецЕсли;
	//	
	//КонецЦикла;
	//Если не Поиск тогда
	//    ЭлОтбора = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//    ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//    ЭлОтбора.Использование = ЗначениеЗаполнено(Объект.ОбъектЭксплуатации);
	//    ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Техника");
	//    ЭлОтбора.ПравоеЗначение = Объект.ОбъектЭксплуатации;
	//КОнецЕсли;	
	//ФормаОтчета.Открыть();
	ОткрытьФорму("Отчет.пкЗаказНаряды.ФормаОбъекта",
		Новый Структура("КлючВарианта, КлючНазначенияИспользования, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов", 
			"ЗаказНаряды",
			, 
			Новый Структура("Техника", Объект.ОбъектЭксплуатации), 
			Истина,
			Ложь));
//Рарус Владимир Подрезов Конец
	
КонецПроцедуры

&НаСервере
Процедура ЗаказНарядыПоТехникеНаСервере(СхемаКомпоновкиДанных)
	СхемаКомпоновкиДанных=Отчеты.пкЗаказНаряды.Создать().СхемаКомпоновкиДанных;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
        
    ОбъектыСтроительства = пкОбщегоНазначенияСервер.ПолучитьОбъектыСтроительстваКлиента(Объект.Клиент);
    
    Отбор = Новый Структура("Ссылка", ОбъектыСтроительства);
    
    ПараметрыФормы = Новый Структура("Отбор", Отбор);
        
    ОткрытьФорму("Справочник.СМ_ОбъектыСтроительства.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , 
        Новый ОписаниеОповещения("ОбъектСтроительстваНачалоВыбораЗавершение", ЭтаФорма));

КонецПроцедуры

Процедура ОбъектСтроительстваНачалоВыбораЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
    
    Если ВыбранноеЗначение <> Неопределено Тогда
        Объект.ОбъектСтроительства = ВыбранноеЗначение;
    КонецЕсли;    
    
КонецПроцедуры    

//++ Рарус Лимаренко 01.08.2018 Задача№13519
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОбращения) Тогда
		 Объект.ДатаОбращения = ТекущаяДата();	
	КонецЕсли;	
	
	ПодразделениеСПБ            = Константы.пкПодразделениеСанктПетербург.Получить();
	ПодразделениеМосква         = Константы.пкПодразделениеМосква.Получить();
	
	Если (Объект.Подразделение = ПодразделениеМосква И Объект.Организация = Объект.Организация.ГоловнаяОрганизация)
		ИЛИ (Объект.Подразделение <> ПодразделениеМосква И НЕ Объект.Организация = Объект.Организация.ГоловнаяОрганизация) Тогда
		
		Ошибки = Неопределено;
          
        ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Подразделение", НСтр("ru='Организация не соответствует подразделению.'"), Неопределено);    
        
        ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьКонтактноеЛицоНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Владелец = &Владелец
		|	И КонтактныеЛицаПартнеров.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Клиент);
	Запрос.УстановитьПараметр("Наименование", Объект.Комментарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		 Возврат "Существует";
	КонецЕсли;
	
	КонтактоеЛицо 				= Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
	КонтактоеЛицо.Автор	 		= Пользователи.ТекущийПользователь();
	КонтактоеЛицо.Владелец		= Объект.Клиент;
	КонтактоеЛицо.Наименование	= Объект.Комментарий;
	Попытка
		КонтактоеЛицо.Записать();			
		Возврат КонтактоеЛицо.Ссылка;
	Исключение
	    Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
		
КонецФункции

&НаКлиенте
Процедура СоздатьКонтактноеЛицо(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда	
		ПоказатьПредупреждение(,НСтр("ru='Надо заполнить клиента!'"));
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Комментарий) Тогда
		ПоказатьПредупреждение(,НСтр("ru='Поле комментарий пусто!'"));	
	    Возврат;
	КонецЕсли;
	
	КонтактоеЛицо = СоздатьКонтактноеЛицоНаСервере();
	
	Если КонтактоеЛицо = "Существует" Тогда
		ПоказатьПредупреждение(,"Такое контактное лицо уже существует!");
		Возврат;
	КонецЕсли;
	
	Если КонтактоеЛицо <> Неопределено Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		СтруктураПараметры = Новый Структура("КонтактоеЛицо",КонтактоеЛицо);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, СтруктураПараметры);
		ПоказатьВопрос(Оповещение,НСтр("ru = 'Контактное лицо успешно создано, открыть его форму?';"
     	+ " en = 'Do you want to open?'"), Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да И Параметры <> Неопределено И Параметры.КонтактоеЛицо <> Неопределено Тогда
		ОткрытьЗначение(Параметры.КонтактоеЛицо);		
	КонецЕсли;

КонецПроцедуры

//-- Рарус Лимаренко 01.08.2018 Задача№13519

#КонецОбласти
